kaomoji=(
	"^_^"
	"^ω^"
	"^o^"
	"~\\(≧▽≦)/~"
	"*^_^*"
	"↖(^ω^)↗"
	"(^o^)／"
	"(=^▽^=)"
	"=^_^="
	"(*^ω^*)"
	"o(￣▽￣)o"
	"Y(^_^)Y"
	"╰(*´︶\`*)╯"
	"ヾ ^_^♪"
	"=￣ω￣="
	"︿(￣︶￣)︿"
	"(´▽｀)ノ♪"
	"～(￣▽￣～)(～￣▽￣)～"
	"QwQ"
	"(●—●)"
	"(๑•.•๑)"
	"(｡ì_í｡)"
	"(*/ω＼*)"
	"●▽●"
	"( σ'ω')σ"
	"♡＾▽＾♡"
	"(๑•̀ㅂ•́)و✧"
	"(｡･ω･｡)ﾉ♡"
	"(☆_☆)"
	"(๑°3°๑)"
	"_(•̀ω•́」∠)_"
	"♪～(´ε｀　)"
	"～(^з^)-☆"
	"(´∀｀)♡"
	"(＞﹏＜)"
	"T_T"
	"⊙︿⊙"
	"〒▽〒"
	"⊙﹏⊙"
	"π_π"
	"(｡•́︿•̀｡)"
	"(ToT)/~~~"
	"╯﹏╰"
	"(╥╯^╰╥)"
	"(〃′o\`)"
	"●﹏●"
	"(•̥́ˍ•̀ू )"
	"(つд⊂)"
	"(╥﹏╥)"
	"┭┮﹏┭┮"
	"（；´д｀）ゞ"
	"(´;︵;\`)"
	"(。﹏。)"
	"┗(T﹏T)┛"
	"QAQ"
	"ヘ(_　_ヘ)"
	"╰（‵□′）╯"
	"(*￣︿￣)"
	">o<"
	"ヽ(‘⌒´メ)ノ"
	"(*｀Ω´*)v"
	"(｡•ˇ‸ˇ•｡)"
	"(;｀O´)o"
	"╰_╯"
	"<(｀^´)>"
	"（｀Δ´）！"
	"ψ(｀∇´)ψ"
	"(；′⌒\`)"
	"s(・｀ヘ´・;)ゞ"
	"￣へ￣"
	"←_←"
	"（╯‵□′）╯︵┴─┴"
	"（▼へ▼メ）"
	"→_→"
	"⊙_⊙"
	"d(ŐдŐ๑)"
	"Σ(°△°|||)︴"
	"(((φ(◎ロ◎;)φ)))"
	"⊙▽⊙"
	"(๑ŐдŐ)b"
	"╭(°A°\`)╮"
	"⊙ω⊙"
	"Σ(っ°Д°;)っ"
	"(ﾟДﾟ≡ﾟдﾟ)!?"
	"(*・ω・)✄╰ひ╯"
	"(⊙x⊙;)"
	"┌(。Д。)┐"
	"(°ー°〃)"
	"︽⊙_⊙︽"
	"!!!∑(°Д°ノ)ノ"
	"(๑ŐдŐ)b☆d(ŐдŐ๑)"
	"ヽ(*。>Д<)o゜"
	"=_="
	"╮(╯_╰)╭"
	"（︶︿︶）"
	"_(:з」∠)_"
	"@_@"
	"╮(╯▽╰)╭"
	"(＠￣ー￣＠)"
	"_(:3」∠❀)_"
	"╭(╯ε╰)╮"
	"(ー_ー)!!"
	"_(:D)∠)_"
	"o_O"
	"╭(╯^╰)╮"
	"(；一_一)"
	"´_>\`"
	"-_-#"
	"┑(￣Д￣)┍"
	"≡￣﹏￣≡"
	"○|￣|_"
	"-_-||"
	"▄█▀█●"
)

display_kaomoji() {
  (
		local kaomoji_count=${#kaomoji[@]}
		(( kaomoji_count == 0 )) && return

		local random_index=$((RANDOM % kaomoji_count + 1))
		local chosen_kaomoji="${kaomoji[random_index]}"
		printf "\e]1337;SetBadgeFormat=%s\a" "$(echo -n "$chosen_kaomoji" | base64)"
  ) &!
}

clear_badge() {
  printf "\e]1337;SetBadgeFormat=%s\a" "$(printf '' | base64)"
}

preexec() {
	local -a clear_badge_cmd_patterns
	local pattern

	clear_badge_cmd_patterns=(
		${(z)${EMOBAGE_CLEAR_BADGE_CMDS:-"nvim* vim* less* man*"}}
	)

	for pattern in "${clear_badge_cmd_patterns[@]}"; do
		[[ -z "$pattern" ]] && continue
		if [[ "$1" == ${~pattern} ]]; then
			clear_badge
			return
		fi
	done
}

precmd() {
  display_kaomoji
}